%% 
clear all
clc
A = [3 12 1;12 0 2;6 0 1];
b = [2.36 5.26 2.63]';
x = A(1:2,1:2)\b(1:2);
x(3) = 0; % 取定x(3)=0有唯一解
z = null(A); % 求线性映射的矩阵A这个线性映射的零空间，作为齐次解空间的基
A*z % 作用于零空间是0
t = rand; % 任取标量
y = x+t*z; % 构造非齐次的通解 实际上非齐次的特解是F^n上关于nullT的商空间的元素
A*y % 验证通解
%%
clear all
clc
A = [1 0;0 2];
a = [-1 2]';
x1 = A\a
B = [1 2;3 4];
b = [1 1]';
x2 = B\b
C = [1 2;3 6];
c = [1 2]';
x3 = C\c
D = [1 2;3 6];
d = [1 3]';
x4 = D\d
%%
clear all
clc
A = [1 2 3;4 5 6;7 8 9];
b = [0 0 0]';
x = A\b;
x
null(A)
%%



















