%% 曲线拟合主要用于 估算数据，预测趋势
%% 曲线拟合采用多项式拟合的方法 ployfit() (采用的拟合原则为最小二乘拟合，即误差的平方和最小)
% polyfit(): 求得最小二乘拟合多项式系数
% P = polyfit(X,Y,m): X,Y为样本数据，m是要产生的拟合多项式的最高次数 通常为3。P是拟合多项式的系数向量
% [P,S] = polyfit(X,Y,m): 这里S是采样点的误差向量。其他字母和上面的意义一致
% [P,S,mu] = polyfit(X,Y,m): mu是一个二元向量，mu(1)是mean(X),mu(2)是std(X)
clear all
clc
x = 1790:10:2010;
y = [3.9,5.3,7.2,9.6,12.9,17.1,23.2,31.4,38.6, 50.2,63.0,76.0,92.0,105.7,122.8,131.7,150.7,179.3,203.2,226.5,248.7,281.4,308.7];
plot(x,y,'*');
p = polyfit(x,y,3);
hold on
x1 = 1790:2010;
target_val = polyval(p,2020);
plot(x1,polyval(p,x1),'r');
hold on
plot(2020,target_val,'rp');
target_2016_val = polyval(p,2016);
%% 上面的相对误差太大，综合背景环境，我们认为应当使用二战后至今这段时间的数据，因为这段时间相对来说经济发展
% 环境稳定，人口增长更有规律
clear all
clc
x = 1950:10:2010;
y = [150.7,179.3,203.2,226.5,248.7,281.4,308.7];
plot(x,y,'*');
hold on
%[p,S] = polyfit(x,y,1);
%plot(x,polyval(p,x),'b');
%hold on
[p2,S2] = polyfit(x,y,2);
plot(x,polyval(p2,x),'r');
hold on;
target_2016_val = polyval(p2,2016);

%% 
x = [2,3,4,5,8,9,10,11,12,15,16,17,18,19,22,23,24,25,26,29,30];
y = [7.74,7.84,7.82,7.78,7.91,7.97,7.9,7.76,7.9,8.04,8.06,8.11,8.08,8.13,8.03,8.01,8.06,8.0,8.3,8.41,8.28];
plot(x,y,'*');
p = polyfit(x,y,3);
hold on
x1 = [31,32,33];
y1 = [8.27,8.17,9.54];
xi = [x,x1];
plot(xi,polyval(p,xi),'r');
hold on
plot(x1,y1,'rp');

%% 
clear all
clc
x=0.03:0.03:0.3; % 随机性参数
y1=[0.01,0.01,0.02,0.03,0.06,0.07,0.13,0.17,0.25,0.37]; % 多样性
y2=[0.85,0.76,0.68,0.62,0.56,0.52,0.49,0.46,0.43,0.39]; % 收敛性
plot(x,y1,'bo',x,y2,'rp');
p1 = polyfit(x,y1,2);
p2 = polyfit(x,y2,2);
g = p1-p2;
root = roots(g);
hold on
x1 = 0.03:0.03:0.4
plot(x1,polyval(p1,x1),'b',x1,polyval(p2,x1),'r',root(2),polyval(p1,root(2)),'gp');














