%% 数据插值主要用于样本数据少但是又需要较多的数据时用来生成多的数据
% interp1(X,Y,X1,method): 根据X,Y的值计算出函数在X1处的值
% method的选择包括以下几种:
% linear: 线性插值，连接已知点的直线，取插值点在该直线上对应的纵坐标为插值点的值
% nearest: 最近邻插值，选择最近样本点的值为插值数据
% pchip: 采用分段三次多项式进行插值，同时还满足若干节点处相邻插值函数的一阶导数相等(使得曲线光滑),具有保形性(极大值，极小值不变)
% spline: 采用三次样条插值，同时还满足具有连续的一阶导数和二阶导数，使得曲线更加光滑
clear all
clc
x = [0,3,5,7,9,11,12,13,14,15];
y = [0,1.2,1.7,2.0,2.1,2.0,1.8,1.2,1.0,1.6]; % 以上就是样本点
x1 = 0:0.1:15;% 希望产生的数据点横坐标
y1 = interp1(x,y,x1,'spline');
plot(x1,y1);
%% 除了一维插值，还有二维插值
% interp2(X,Y,Z,X1,Y1,method): 这里x1,y1应该一个行向量，一个是列向量
% 其中X,Y是两个向量，表示两个参数的采样点，Z是采样点对应的函数值。X1、Y1是要插值的点
clear all
clc
x = 20:10:90;
y = (0:5:20),
z = [8.9,10.32,11.3,12.5,13.9,15.3,17.8,21.3;8.7,10.8,11,12.1,13.2,14.8,16.55,20.8;8.3,9.65,10.88,12,13.2,14.6,16.4,20.5;8.1,9.4,10.7,11.9,13.1,14.5,16.2,20.3;8.1,9.2,10.8,12,13.2,14.8,16.9,20.9];
x1 = 20:90;
y1 = (0:20)';
z1 = interp2(x,y,z,x1,y1,'spline');
[X,Y] = meshgrid(x1,y1);
surf(X,Y,z1);

%% 
clear all
clc
v = 20:10:150;% 速度向量，单位为km/h
vs = (1000/3600)*v; % 将km/h化为m/s
d2 = [3.15,7.08,12.59,19.68,28.34,38.57,50.4,63.75,78.71,95.22,113.29,132.93,154.12,176.87]; % 停车视距
v_c = 20:150;
d_c = interp1(v,d2,v_c,'spline');
d1 = 10*(1000/3600)*v_c;
d3 = 10;
d = d1+d_c+d3;
% 现在需要在d_c中查找值为120的项所对应的v
% 这里的思路实际上是找距离120最近的那一项所对应的v，这种方法具有一定的柔性，但一定有一个答案
x = abs(d-120); % 计算插值得出的有效视距到120的距离
[y,i] = sort(x); % y存储排序后的向量，i存储排序后的每一个元素在原来向量x中的位置
% 这样一来y(1)即为最接近120的元素，而i(1)则为该元素在原x向量中的位置，即在原d_c中的位置，故最大速度即在v_c中的位置
v_c(i(1))
plot(v_c,d,v_c(i(1)),d(i(1)),'rp');

%% 
clear all
clc
x = 0:200:1800;
y = x;
[X,Y] = meshgrid(x,y);
z = [2000,2000,2001,1992,1954,1938,1972,1995,1999,1999;2000,2002,2006,1908,1533,1381,1728,1959,1998,2000;
   2000,2005,2043,1921,977,897,1310,1930,2003,2000;1997,1978,2009,2463,2374,1445,1931,2209,2050,2003;
   1992,1892,1566,1971,2768,2111,2653,2610,2121,2007;1991,1875,1511,1556,2221,1986,2660,2601,2119,2007;
   1996,1950,1797,2057,2849,2798,2608,2303,2052,2003;1999,1999,2079,2685,3390,3384,2781,2165,2016,2000;
   2000,2002,2043,2271,2668,2668,2277,2049,2003,2000;2000,2000,2004,2027,2067,2067,2027,2004,2000,2000];
x_c = 0:50:1800;
y_c = x_c;
z_c = interp2(x,y,z,x_c,y_c','spline');
[X_C,Y_C] = meshgrid(x_c,y_c);
subplot(2,2,1);
surf(X,Y,z);
subplot(2,2,2);
surf(X_C,Y_C,z_c);
subplot(2,2,3);
surfc(X_C,Y_C,z_c);
subplot(2,2,4);
contour(X_C,Y_C,z_c,12); % contour用于画等高线












