function M_tree = morse_tree
    % 叶子节点
    h = {'H',{},{}};
    v = {'V',{},{}};
    f = {'F',{},{}};
    l = {'L',{},{}};
    p = {'P' {} {}};
    j = {'J' {} {}};
    b = {'B' {} {}};
    x = {'X' {} {}};
    c = {'C' {} {}};
    y = {'Y' {} {}};
    z = {'Z' {} {}};
    q = {'Q' {} {}};
    % 父节点
    s = {'S',h,v};
    u = {'U',f,{}};
    r = {'R',l,{}};
    w = {'W',p,j};
    d = {'D' b x};
    k = {'K' c y};
    g = {'G' z q};
    o = {'O' {} {}};
    i = {'I' s u};
    a = {'A' r w};
    n = {'N' d k};
    m = {'M' g o};
    e = {'E' i a};
    t = {'T' n m};
    % 根节点
    M_tree = {'',e,t};
end
